[M_IrisHUB_MonsterHunter MissionDefinition]
TurnInDescription="One day, the denizens of Pandora will get over their childish obsession with puns.<br><br>Today is not that day."

[M_IrisHUB_MonsterHunter:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue asked you to hunt down a vicious monster out in [place]Southern Raceway[-place].<br><br>You tracked down the ''monster'' and discovered that it was, in fact, a monster TRUCK. Better destroy it."
